tobiastestproject/scripts/textExtractionAlgorithm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>textExtractionAlgorithm</title>
<!-- 2017-11-21 Di 10:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tobias Wenzel" />
</head>
<body>
<div id="content">
<h1 class="title">textExtractionAlgorithm</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. for file in files:</a>
<ul>
<li><a href="#sec-1-1">1.1. convert pdf to xml like:</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. load (all) data with pdfbox</a></li>
<li><a href="#sec-1-1-2">1.1.2. write doc to xml file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> for file in files:</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="underline">class</span>: testpackage.preprocessing.ConvertPdfXMLTester
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> convert pdf to xml like:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<span class="underline">class</span>: testpackage.preprocessing.ConvertPdfXML<br  />
<span class="underline">function</span>: run
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> load (all) data with pdfbox</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<span class="underline">link</span>: <a href="https://pdfbox.apache.org/">Pdfbox-Homepage</a> 
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>if title (metadata) set and ok =&gt; take it<br  /><div class="outline-text-5" id="text-1-1-1-1">
<p>
every field is checked for digits, weird signs and min-length (see <span class="underline">function</span> clean_field). 
max-length also possible, but consider "title-like" idea. that's why i chose 500.
</p>
</div>
</li>
<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>else use docear to extract title<br  /><div class="outline-text-5" id="text-1-1-1-2">
<p>
<span class="underline">link</span>: <a href="https://www.docear.org/tag/title-extraction/">Docear-Homepage</a><br  />
if still no title use no entry or implement title-like
</p>
</div>
</li>
<li><a id="sec-1-1-1-3" name="sec-1-1-1-3"></a>use title to get Article-Object from DBLP<br  /><div class="outline-text-5" id="text-1-1-1-3">
<p>
<span class="underline">class</span>: testpackage.preprocessing.DBLPDataAccessor<br  />
<span class="underline">function</span>: getArticleObj <br  />
<span class="underline">link</span>: <a href="http://dblp.uni-trier.de/faq/How+to+use+the+dblp+search+API.html">DBLP-API</a>
</p>
</div>
</li>
<li><a id="sec-1-1-1-4" name="sec-1-1-1-4"></a>if successful use all of it's data<br  /><div class="outline-text-5" id="text-1-1-1-4">
<p>
possible fields include: title, year, author, doi and score. idea to choose best score.
</p>
</div>
</li>
<li><a id="sec-1-1-1-5" name="sec-1-1-1-5"></a>else try to extract element otherwise<br  /><div class="outline-text-5" id="text-1-1-1-5">
<p>
with pdfbox (metadata) and NE-recognition (OpenNLP, <span class="underline">function</span> extractAuthors). last resort: no entry.<br  />
<span class="underline">link</span>: <a href="https://opennlp.apache.org/docs/1.5.3/manual/opennlp.html">OpenNlp-Doc</a>
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> write doc to xml file</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<span class="underline">function</span> writeToXML
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobias Wenzel</p>
<p class="date">Created: 2017-11-21 Di 10:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
